FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Цеха.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Цеха</Name>
			<Comment>Цеха компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании, к которому относится цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Comment>Мастер цеха, подставляемый по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехДляАнализаЭффиктивности</Name>
					<Comment>Цех для анализа эффиктивности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВУРВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ПодразделенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодразделенияКомпании</Name>
			<Comment>Подразделения компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>Префикс автонумерации для документов (до 3-х букв)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановкаЦенДокументамиПоступления</Name>
					<Comment>Установка цен документами поступления</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗакупочнуюЦену</Name>
					<Comment>Формировать закупочную цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьНормативнуюЦену</Name>
					<Comment>Формировать нормативную цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаРозницаПоПриходу</Name>
					<Comment>Переоценивать розничные остатки при оприходовании товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаРозницаПоРасходу</Name>
					<Comment>Переоценивать розничные остатки при списании товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Балансовое</Name>
					<Comment>Признак того, что подразделение является балансовым</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Основная валюта подразделения. Подставляется по умолчанию в новые документы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>Основной банковский счет организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаТД</Name>
					<Comment>Ответственный за тест-драйв</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Вид налога</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Если флажок установлен, то при заполнении приходных документов от этого подразделения, товары будут поступать без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>тт_НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тт_НаправлениеДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_НазваниеДляССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ПодразделениеКМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_ПодразделенияКМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ВключитьРезервированиеПоЗаявкеНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ПодразделениеССП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_ПодразделенияССП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Цеха/Ext/ManagerModule.bsl
// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	ЦехаОсновнойЦех = Справочники.Цеха.ОсновнойЦех.ПолучитьОбъект();
	Если ЗаполнятьВсе Тогда
		ЦехаОсновнойЦех.Код="00000";
		ЦехаОсновнойЦех.Наименование = "Основной цех";
		ЦехаОсновнойЦех.Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		ЦехаОсновнойЦех.Организация = Справочники.Организации.ОсновнаяОрганизация;
		ЦехаОсновнойЦех.СкладКомпании = Справочники.СкладыКомпании.ОсновнойСкладКомпании;
		ЦехаОсновнойЦех.ГрафикРаботы = ЦехаОсновнойЦех.Подразделение.ГрафикРаботы;
		Если НЕ обЗначениеНеЗаполнено(ЦехаОсновнойЦех.Подразделение.ГрафикРаботы) Тогда
			ЦехаОсновнойЦех.ГрафикРаботы = ЦехаОсновнойЦех.Подразделение.ГрафикРаботы;
		КонецЕсли;
	Иначе
		Если обЗначениеНеЗаполнено(ЦехаОсновнойЦех.Наименование) Тогда
			ЦехаОсновнойЦех.Наименование = "Основной цех";
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ЦехаОсновнойЦех.Подразделение) Тогда
			ЦехаОсновнойЦех.Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ЦехаОсновнойЦех.Организация) Тогда
			ЦехаОсновнойЦех.Организация = Справочники.Организации.ОсновнаяОрганизация;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ЦехаОсновнойЦех.СкладКомпании) Тогда
			ЦехаОсновнойЦех.СкладКомпании = Справочники.СкладыКомпании.ОсновнойСкладКомпании;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ЦехаОсновнойЦех.ГрафикРаботы) Тогда
			Если НЕ обЗначениеНеЗаполнено(ЦехаОсновнойЦех.Подразделение.ГрафикРаботы) Тогда
				ЦехаОсновнойЦех.ГрафикРаботы = ЦехаОсновнойЦех.Подразделение.ГрафикРаботы;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	НовыйЭлемент = ЦехаОсновнойЦех.ЭтоНовый();
	Если ЦехаОсновнойЦех.Модифицированность() Тогда
		Попытка
			ЦехаОсновнойЦех.Записать();
			Сообщить("Справочник ""Цеха"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ЦехаОсновнойЦех.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
